import chromadb
from chromadb.utils import embedding_functions

# Створюється об'єкт-клієнт. Слово «Persistent» означає «постійний»: дані зберігаються на диск у папку chroma_db.
client = chromadb.PersistentClient(path='chroma_db')
# Для багатомовна модель, яка перетворює текст на вектори
ef = embedding_functions.SentenceTransformerEmbeddingFunction(model_name='paraphrase-multilingual-MiniLM-L12-v2')
# Створення колекції
collection = client.get_or_create_collection(name="company_docs_multi", embedding_function=ef)

# Текст документа
context_text = ['''1. Кожен співробітник має право на щорічну оплачувану відпустку тривалістю 24 календарні дні,
яку необхідно узгодити з керівником відділу не пізніше ніж за два тижні до її початку.''',
'''2. Стандартний графік роботи компанії передбачає п'ятиденний робочий тиждень з 09:00 до 18:00,
а у п'ятницю робочий день скорочується на одну годину.''',
'''3. У разі виробничої необхідності співробітники можуть залучатися до роботи у вихідні дні, що
оплачується у подвійному розмірі або компенсується додатковим днем відпочинку.''',
'''4. Повернення придбаного товару належної якості можливе протягом 14 днів з моменту покупки за
умови збереження його оригінальної упаковки та чека.''',
'''5. Якщо товар має виробничий дефект, клієнт має право вимагати його заміни на аналогічний або
повернути повну вартість протягом гарантійного терміну.''']

# Додаємо пункти документа в колекцію; якщо id уже є, оновлюємо запис, а не дублюємо
collection.upsert(
    documents=context_text,
    ids=[f'p{i}' for i, _ in enumerate(context_text, start=1)],
    metadatas=[{'point': i} for i, _ in enumerate(context_text, start=1)]
)
# Питання до ШІ
questions = ('Чи можна повернути товар через 20 днів після покупки?', 
             'Скільки триває відпустка?', 
             'скільки днів на відпочинок?', 
             'чи треба виходити в суботу?', 
             'чи можна обміняти зламаний товар?', 
             'Скільки триває лікарняний?',
             'Скільки сантиметрів у метрі?', 
             'Яка зарплата в компанії?'
)
# Для кожного питання шукаємо два найближчі пункти з колекції й друкуємо їх, id та відстані
for question in questions:
    print(question)

    result = collection.query(query_texts=question, n_results=2)
    print(result['documents'][0])

    for ids, distance in zip(result['ids'][0], result['distances'][0]):
        print(ids, distance)
    

