from db import collection


context_text = ['''1. Кожен співробітник має право на щорічну оплачувану відпустку тривалістю 24 календарні дні,
яку необхідно узгодити з керівником відділу не пізніше ніж за два тижні до її початку.''',
'''2. Стандартний графік роботи компанії передбачає п'ятиденний робочий тиждень з 09:00 до 18:00,
а у п'ятницю робочий день скорочується на одну годину.''',
'''3. У разі виробничої необхідності співробітники можуть залучатися до роботи у вихідні дні, що
оплачується у подвійному розмірі або компенсується додатковим днем відпочинку.''',
'''4. Повернення придбаного товару належної якості можливе протягом 14 днів з моменту покупки за
умови збереження його оригінальної упаковки та чека.''',
'''5. Якщо товар має виробничий дефект, клієнт має право вимагати його заміни на аналогічний або
повернути повну вартість протягом гарантійного терміну.''']

collection.upsert(
    documents=context_text,
    ids=[f'p{i}' for i, _ in enumerate(context_text, start=1)],
    metadatas=[{'point': i} for i, _ in enumerate(context_text, start=1)]
)
